Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སྤྲིན་ཆེན་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Great Cloud

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། འཕགས་པ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas, bodhisattvas, exalted śrāvakas, and pratyekabuddhas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་ལ་སོགས་པ་དགེ་སློང་ས་ཡ་ཕྲག་དགུ་དང་བརྒྱད་འབུམ་གྱི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་། དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། དབང་དང་ལྡན་པར་གྱུར་པ། ཉོན་མོངས་པ་མེད་པ།
en: The Bhagavān was residing on Vulture Peak in Rājagṛha with an assembly of nine million eight hundred thousand bhikṣus including Mahākāśyapa. All of them were worthy ones who had exhausted their defilements, had attained mastery, and were free from afflictions.

source: ཅང་ཤེས་པ། གླང་པོ་ཆེན་པོ། སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ།
en: They were omniscient ones, great elephants, their minds perfectly liberated, their wisdom perfectly liberated, who had accomplished their tasks and completed their work.

source: ཁུར་བོར་བ། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ།
en: They had cast off their burdens and fulfilled their aims.

source: ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ།
en: Their minds had been emancipated through correct cognition, and they had thoroughly exhausted all the fetters binding them to existence.

source: ཚུལ་ཁྲིམས་ཤིན་ཏུ་རྣམ་པར་དག་པ། སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ། མངོན་པར་ཤེས་པ། མཁས་པར་མངོན་པར་ཤེས་པ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ་ཤ་སྟག་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: They possessed very pure discipline and had obtained supreme perfection in mastering all mental states. They were proficient in the superknowledges. Together, they were all absorbed in meditation on the eight liberations.

source: དེ་ནས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་ལ་སོགས་པ་དགེ་སློང་ས་ཡ་ཕྲག་དགུ་དང་བརྒྱད་འབུམ་པོ་དེ་དག་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: After noon, the elder Mahākāśyapa and the other nine million eight hundred thousand bhikṣus set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Having arrived there, they all prostrated, touching their heads to his feet, and circumambulated the Bhagavān three times. With palms joined, they bowed toward the Bhagavān and sat down to one side.

source: ཡང་དེའི་ཚེ་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱི་ལ་སོགས་པ་དགེ་སློང་མ་ས་ཡ་ཕྲག་དྲུག་དང་ལྔ་འབུམ་ཡང་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་
en: At that time, there were also six million five hundred thousand bhikṣuṇīs, including Mahāprajāpatī Gautamī and others.

source: བྱུང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: After noon, they all set forth from their respective abodes and went to where the Bhagavān was staying.

source: ཡང་དེའི་ཚེ་སྤྲིན་ཆེན་སྙིང་པོ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་གཙོ་བོ་ཆེན་པོ་ས་ཡ་ཕྲག་དྲུག་དང་བརྒྱད་འབུམ་ལ་འདི་ལྟ་སྟེ།
en: At that time, there were also six million eight hundred thousand bodhisattvas, great lords, including Great Cloud Essence and others.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་འོད་སྲུང་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་གློག་གི་འོད་ཅེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་འབྲུག་བསྒྲགས་དབྱངས་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་བརྩོན་འགྲུས་སྲུང་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་དགའ་བྱེད་ཅན་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རབ་དགའ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་བརྩེགས་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རྡོ་རྗེ་དཔལ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་ངེས་པར་སྒྲ་སྒྲོགས་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་གྲགས་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་གློག་གི་འོད་ཀྱི་དྲ་བ་ཅན་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་གློག་སྦྱིན་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་དཔྱོད་པ་ལ་མཁས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རྩལ་གྱིས་འགྲོ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་སེང་གེ་སྒྲ་སྒྲོགས་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་ཆུ་རྒྱས་བློ་གྲོས་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་བརྩོན་འགྲུས་ལྟོ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་ལྟ་བའི་དུས་ཚོད་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་མངོན་པར་འཕགས་པའི་གྲགས་པ་མཐའ་ཡས་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་ཡང་དག་པར་ལྟ་བ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་མུ་སྟེགས་སུ་གྱུར་པའི་དབང་ཕྱུག་ཅེས་བྱ་བ་དང་། སྤྲིན་ཆེན་བསོད་ནམས་ཞིང་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་བསིལ་བར་གྱུར་ཅེས་བྱ་བ་དང་། སྤྲིན་ཆེན་ཉི་མའི་སྙིང་པོ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་ཟླ་བའི་གཟི་བརྗིད་ཅེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རིན་ཐང་མེད་པའི་བཻ་དཱུརྱ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རྟག་ཏུ་ལྟ་བ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རྟག་པའི་རང་བཞིན་ལ་དགའ་བ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རྣམ་པར་རྒྱལ་བའི་སྡེ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་འོད་རྒྱས་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རྣམ་པར་རྒྱལ་བའི་ཀླུས་བྱིན་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་དགའ་བས་འཚོ་བའི་དཔལ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་དེད་དཔོན་མིག་ཅེས་བྱ་བ་དང་། སྤྲིན་ཆེན་ཅོད་པན་གྱིས་སྤུངས་སྐྱེས་པ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་སྟོན་པར་གྱུར་པ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་ས་བོན་སྲུང་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རྣམ་པར་རྒྱལ་བའི་པད་མ་དཀར་པོ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་མེ་ལྟ་བུའི་ཡེ་ཤེས་ཀྱི་པད་མ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་བསྒོ་བས་བསྒོས་པའི་ཨུད་པ་ལའི་དྲི་ལྡན་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་སྟག་ཅེས་བྱ་བ་དང་། སྤྲིན་ཆེན་འདྲེན་སྤྱོད་ཅེས་བྱ་བ་དང་། སྤྲིན་ཆེན་མི་འཇིགས་སྒྲ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་ཏ་མ་ལའི་ལོ་མ་བསིལ་བ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རིན་ཆེན་ཙན་དན་བསིལ་བའི་ལུས་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་དམ་པ་ཞེས་བྱ་བ་དང་སྤྲིན་ཆེན་ཡ་མཚན་ལ་མཁས་པ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་དགའ་བ་སྲེད་མེད་ཀྱི་བུ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་སྙན་དངགས་མཁན་གྱི་ཁྱུ་མཆོག་ཅེས་བྱ་བ་དང་། སྤྲིན་ཆེན་སྙིང་པོ་ཕྲ་བ་ལ་འཇུག་པ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་དམ་པའི་ཆོས་མཆོག་པད་མ་དཀར་པོ་རྒྱས་པའི་གདོང་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་དམ་པའི་གདོང་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་དམ་པའི་ཆོས་ཀྱི་རྒྱུན་རྟོགས་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་གྲགས་པའི་བདེ་བ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་གསེར་གྱི་རི་བོའི་རྒྱལ་པོའི་དཔལ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་སྨན་ཀུན་སྦྱིན་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་སྨན་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་ལུས་ཆེན་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་མཁའ་ལ་མངོན་པར་འཕགས་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་སྒྲ་ལྡན་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་དྲི་མ་སེལ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་སྒྲོན་མ་པད་མའི་དཔལ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རྣམ་པར་སྒྲོགས་པ་ལེན་པ་མེད་པའི་རྟོག་པ་མ་འདྲེས་པ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་མུན་སེལ་ཞེས་བྱ་བ་དང་། སྤྲིན་ཆེན་རིམ་པའི་ཐོག་ཏོག་སེལ་བ་ཞེས་བྱ་བ་དང་།
en: These included the bodhisattva mahāsattva Great Cloud Essence, the bodhisattva mahāsattva Great Cloud Light Protector, the bodhisattva mahāsattva Great Cloud Lightning Flash, the bodhisattva mahāsattva Great Cloud Thunderclap, Great Cloud Protector of Diligence, Great Cloud Producer of Joy, Great Cloud Utter Joy, Great Cloud Heap, Great Cloud Vajra Glory, Great Cloud Proclaimer of Certainty, Great Cloud Fame, Great Cloud Lightning Net, Great Cloud Lightning Offering, Great Cloud King of Skillful Analysis, Great Cloud Playful Gait, Great Cloud King of the Lion’s Roar, Great Cloud Vast Intellect, Great Cloud Sustained by Diligence, Great Cloud King of the Seeing Eye, Great Cloud King of Magical Manifestation, Great Cloud Infinitely Renowned as Exalted, Great Cloud Correct View, Great Cloud Lord of Non-Buddhists, Great Cloud Field of Merit, Great Cloud Attainment of Coolness, Great Cloud Solar Essence, Great Cloud Lunar Brilliance, Great Cloud Priceless Beryl, Great Cloud Ever Watchful, Great Cloud Delighting in the Eternal Nature, Great Cloud Ocean of Intelligence, Great Cloud Victorious Army, Great Cloud Vast Light, Great Cloud Victorious Nāga Offering, Great Cloud Glory of Living Joyously, Great Cloud Captain’s Eye, Great Cloud Heaped Crowns, Great Cloud Teacher, Great Cloud Seed Protector, Great Cloud Victorious White Lotus, Great Cloud Fire-Like Lotus of Gnosis, Great Cloud Fragrance of Perfume-Infused Utpala Flower, Great Cloud Tiger, Great Cloud Acting as a Guide, Great Cloud Fearless Roar, Great Cloud Coolness of Tamala Leaves, Great Cloud Bathed in Precious Sandalwood, Great Cloud Excellence, Great Cloud Skilled in Marvels, Great Cloud Joyful Child without Craving, Great Cloud Most Skilled in Poetry, Great Cloud Entering into the Subtle Essence, Great Cloud Lush Face of the White Lotus of the Supreme Dharma, Great Cloud Realization of the Continuity of the Excellent Dharma, Great Cloud Bliss of Renown, Great Cloud Glorious Golden Mountain King, Great Cloud Bestowing All Medicines, Great Cloud Medicine King, Great Cloud Great Body, Great Cloud Fully Exalted within Space, Great Cloud Thundering, Great Cloud Dispelling Stains, Great Cloud Glorious Lotus Lamp, Great Cloud Unmixed Conception That Does Not Apprehend Resounding, Great Cloud Dispelling Darkness, and Great Cloud Dispelling Hail.

source: དེ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ས་ཡ་ཕྲག་དྲུག་དང་། བརྒྱད་འབུམ་ཡང་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: After noon these bodhisattvas, numbering six million eight hundred thousand, set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེབཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Having arrived there, they all prostrated, touching their heads to his feet, and circumambulated the Bhagavān three times. With joined palms, they bowed toward the Bhagavān and sat down to one side.

source: ཡང་དེའི་ཚེ་སེང་གེ་སྒྲོན་མ་ལ་སོགས་པ་ལིད་ཚ་བཱི་གཞོན་ནུ་ས་ཡ་ཕྲག་ལྔ་དང་བརྒྱད་འབུམ་ལ་འདི་ལྟ་སྟེ།
en: Also, at that time, there were five million eight hundred thousand Licchavi youths, including Lion Lamp and others.

source: ལིད་ཚ་བཱི་གཞོན་ནུ་ཆོས་བྱིན་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་ཀླུ་མགོ་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་ཆོས་སྡེ་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་དབང་པོས་བྱིན་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་དབང་པོའི་ཏོག་ཅེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་དབང་པོའི་རྒྱལ་མཚན་འོད་ཅེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་སེང་གེའི་སྒྲ་སྒྲོགས་བློ་གྲོས་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་རིན་ཆེན་མགྲིན་དབྱངས་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་རངས་བྱེད་དཔལ་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་ཀླུ་དཔལ་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་རྡོ་རྗེ་ཕྲེང་ལྡན་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་སངས་རྒྱས་འབངས་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་རྒྱལ་བའི་འབངས་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་རྒྱལ་བའི་ཟླ་བ་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་ལག་ཆེན་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་དཔལ་ཆེན་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་གང་གཱས་བྱིན་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་འཇམ་དཔལ་སྙིང་པོ་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་ཀླུ་དགའ་སྟོབས་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་ཀླུས་སྐྱོང་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་ཆོས་སྐྱོང་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་འོད་གྲགས་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་ནམ་མཁའ་མཛོད་ཅེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་གང་གཱས་སྐྱོང་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་སྲིན་ཕྱིས་ཀྱིས་རྣ་ཆ་གདུབ་འཁོར་ཅན་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་གློག་ཕྲེང་ཅན་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་ཁྱད་པར་དགའ་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་ཁྱད་པར་ཅན་གྱི་རིགས་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་དྲི་མེད་འོད་གྲགས་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་གླིང་བུ་ཅན་གྱིས་བྱིན་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་སའི་དབང་ཕྱུག་ཅེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་ས་སྟེང་ཕྲེང་བ་ཅན་ཞེས་བྱ་བ་དང་། ལིད་ཚ་བཱི་གཞོན་ནུ་མཚུངས་པ་མེད་པའི་རྡོ་རྗེའི་བྲན་ཞེས་བྱ་བ་དང་། དེ་དག་ལ་སོགས་པ་ལིད་ཚ་བཱི་གཞོན་ནུ་ས་ཡ་ཕྲག་ལྔ་དང་བརྒྱད་འབུམ་སྟེ།
en: They included the Licchavi youth Dharma Offering, the Licchavi youth Nāga Head, the Licchavi youth Dharma Teachings, the Licchavi youth Indra’s Offering, the Licchavi youth Indra’s Standard, the Licchavi youth Light of Indra’s Banner, the Licchavi youth Intelligence Resounding as a Lion’s Roar, the Licchavi youth Precious Voice, the Licchavi youth Pleasant Glory, the Licchavi youth Nāga Glory, the Licchavi youth Vajra Garland, the Licchavi youth Buddha’s Servant, the Licchavi youth Conqueror’s Servant, the Licchavi youth Conqueror’s Moon, the Licchavi youth Great Arms, the Licchavi youth Great Glory, the Licchavi youth Ganges Offering, the Licchavi youth Essence of Gentle Glory, the Licchavi youth Strength of Nāga Joy, the Licchavi youth Nāga Protector, the Licchavi youth Dharma Protector, the Licchavi youth Luminous Renown, the Licchavi youth Sky Treasury, the Licchavi youth Ganges Protector, the Licchavi youth Adorned with Rākṣasa Earrings, the Licchavi youth Lightning Garland, the Licchavi youth Extraordinary Joy, the Licchavi youth Extraordinary Family, the Licchavi youth Stainless Light Renown, the Licchavi youth Kṛṣṇa’s Offering, the Licchavi youth Earth Lord, the Licchavi youth Earth Garland, and the Licchavi youth Unparalleled Vajra Servant.

source: ལིད་ཚ་བཱི་གཞོན་ནུ་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པ། ཐེག་པ་ཆེན་པོ་ལ་སེམས་རབ་ཏུ་དགའ་བ་ཤ་སྟག་སྟེ།
en: These Licchavi youths, numbering five million eight hundred thousand, had all completely set out toward the attainment of unsurpassed, complete, and perfect awakening, their minds utterly enjoying the Great Vehicle.

source: ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: After noon they set forth from their respective abodes and went to where the Bhagavān was staying.

source: ཡང་དེའི་ཚེ་ལྷའི་བུ་མཐོང་ན་དགའ་བའི་དྲི་ཟའི་རྒྱལ་པོ་ལ་སོགས་པ་ལྷའི་བུ་ས་ཡ་ཕྲག་བཞི་དང་བཞི་འབུམ་ལ་འདི་ལྟ་སྟེ།
en: Also, at that time, there were four million four hundred thousand devaputras such as Gandharva King Delightful Appearance and others.

source: ལྷའི་བུ་མཐོང་ན་དགའ་བའི་དྲི་ཟའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་དགའ་ཞིང་དང་བའི་གྲགས་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་ཟླ་བའི་གཙུག་ཕུད་ཅན་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་ཉི་མའི་མདོག་ཅེས་བྱ་བ་དང་། ལྷའི་བུ་རྣ་འཕྱང་རྣ་ཆ་གདུབ་ཀོར་ཅན་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་རངས་བྱེད་ཀྱི་རོལ་མོའི་ས་འཛིན་ཅེས་བྱ་བ་དང་། ལྷའི་བུ་དཔལ་ཆེན་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་ཟབ་མོ་ཚུལ་ཆེན་པོ་ལ་འཇུག་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་ནག་པོ་ཆེན་པོ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་དཔའ་བའི་བློ་གྲོས་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་ནམ་མཁའ་ལྟར་མིག་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་དགའ་བ་ལ་རྣམ་པར་མོས་པའི་དཔལ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་དགའ་ཕྲེང་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་དགའ་བར་གྲགས་པའི་འོད་ཅེས་བྱ་བ་དང་། ལྷའི་བུ་བཞིན་དགའ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་ཡིད་འཕྲོག་ཅེས་བྱ་བ་དང་། ལྷའི་བུ་བཻ་དཱུརྱའི་འོད་ཅེས་བྱ་བ་དང་། ལྷའི་བུ་བཻ་དཱུརྱ་ལྟར་འོད་སྣང་བ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་སྐར་མ་ལ་དགའ་བ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་འཕྲལ་བ་ཟླ་གམ་ལྟར་འདུག་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་ངེས་པར་སྒྲ་སྒྲོགས་ཟབ་མོ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་ཉོན་མོངས་པ་རྣམ་པར་འཇོམས་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་བརྒྱ་བྱིན་དགའ་བ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་གཞོན་ནུ་ཡིད་དུ་འོང་བ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མན་དཱར་བ་བརྩེགས་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མགོ་ལ་འཁྲི་ཤིང་ཐོགས་པ་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་བུར་མ་སེལ་བའི་བློ་གྲོས་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་དམ་པའི་ཆོས་འཛིན་ཅེས་བྱ་བ་དང་།
en: They were the devaputra Gandharva King Delightful Appearance, the devaputra Renowned for Joyous Faith, the devaputra Moon Crested, the devaputra Sun Colored, the devaputra Earring Adorned, the devaputra King of Pleasant Music, the devaputra Great Glory, the devaputra Engaging in Profound Conduct, the devaputra Great Black One, the devaputra Courageous Intellect, the devaputra Stainless Space-Like Eyes, the devaputra Glory of Complete Dedication to Joy, the devaputra Joy Garland King, the devaputra Luminous Renown of Joy, the devaputra Joyful Face, the devaputra Mind Enchanting, the devaputra Beryl Light, the devaputra Appearance of Beryl-Like Light, the devaputra Enjoys the Stars, the devaputra Half-Moon Forehead, the devaputra Profound Definitive Proclamation, the devaputra Complete Defeat of Affliction, the devaputra Joy of Indra, the devaputra Charming Youth, the devaputra Māndārava Heap, the devaputra Holding a Wish-Fulfilling Vine by the Head, the devaputra Intellect That Removes All Locks, and the devaputra Holder of Excellent Dharma.

source: དེ་དག་ལ་སོགས་པ་ལྷའི་བུ་ས་ཡ་ཕྲག་བཞི་དང་བཞི་འབུམ་སྟེ། ལྷའི་བུ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐེག་པ་ཆེན་པོ་ལ་སེམས་དད་ཅིང་རབ་ཏུ་དགའ་བ།
en: These devaputras, numbering four million four hundred thousand, were all filled with devotion and delight toward the Great Vehicle.

source: དམ་པའི་ཆོས་བསྲུང་བར་དགའ་བ། དམ་པའི་ཆོས་རྒྱས་པར་དགའ་བ་ཏིང་ངེ་འཛིན་ཐམས་ཅད་གཟུང་བར་དགའ་བ་ཤ་སྟག་སྟེ།
en: They took joy only in protecting the excellent Dharma, in spreading the excellent Dharma, and in maintaining all the various samādhis.

source: སེམས་ཅན་རྣམས་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: In order to benefit and please all sentient beings, they set forth after noon from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་སྟོང་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Having arrived there, they all prostrated, touching their heads to his feet, and circumambulated the Bhagavān three times. With palms joined, they bowed toward the Bhagavān and sat down to one side.

source: ཡང་དེའི་ཚེ་ཀླུའི་རྒྱལ་པོ་ས་ཡ་ཕྲག་གཉིས་དང་བརྒྱད་འབུམ་ལ་འདི་ལྟ་སྟེ། ཀླུའི་རྒྱལ་པོ་པད་མ་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་འཇོག་པོ་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་སྟོབས་ཀྱི་རྒྱུ་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་མཐའ་ཡས་ནོར་རྒྱས་ཀྱི་བུ་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་དཔལ་འབྱོར་གནས་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་བྱིས་པ་རྩེ་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་མཆེ་བ་མཆོག་ཏུ་རྣོ་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་མང་ཁྱེར་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་ཡན་ལག་འཆར་རི་དགས་མིག་ཅེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་ཕུར་བུ་སྒྲ་རིག་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་གསེར་མདོག་གདོང་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་སྟང་ཟིལ་གཙུག་ཕུད་ཅེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་ཆུའི་ཤུགས་འཛིན་ཅེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་ཏི་སེའི་གངས་ཐུབ་ཅེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་བྱི་རུ་བཟང་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་ཕྲེང་སྒྲ་སྙན་ཅེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་ལུག་གདོང་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་གནས་སྒྲོགས་མཁས་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་གཟི་ཅན་ཅེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་ནོར་རྒྱས་ཀྱི་བུ་ཞེས་བྱ་བ་དང་།
en: Also, at that time, there were two million eight hundred thousand nāga kings, including the nāga king Padma, the nāga king Takṣaka, the nāga king Sāgara, the nāga king Anavatapta, the nāga king Strong Moving, the nāga king Son of Infinitely Vast Wealth, the nāga king Abode of Prosperity, the nāga king Child’s Play, the nāga king Sharpest Teeth, the nāga king Many Households, the nāga king Clear-Limbed Deer Eyes, the nāga king Bṛhaspati’s Science of Grammar, the nāga king Golden Face, the nāga king Obsidian Hair, the nāga king Holder of Water Power, the nāga king Sage of Mount Kailāśa, the nāga king Beautiful Coral, the nāga king Garland of Pleasant Sounds, the nāga king Sheep Face, the nāga king Skilled at Proclaiming the Abodes, the nāga king Manasvin, and the nāga king Vāsuki.

source: དེ་དག་ལ་སོགས་པ་ཀླུའི་རྒྱལ་པོ་ས་ཡ་ཕྲག་གཉིས་དང་བརྒྱད་འབུམ་སྟེ། ཀླུའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐེག་པ་ཆེན་པོ་ཐོས་པར་འདོད་པ། ཐོས་ནས་ཀྱང་གཞན་དག་ལ་རྒྱས་པར་སྟོན་པར་འདོད་པ།
en: These nāga kings, numbering two million eight hundred thousand, all desired to hear the teachings of the Great Vehicle and then, having heard it, teach it to others.

source: དམ་པའི་ཆོས་འཆད་པར་འདོད་པ། དམ་པའི་ཆོས་ཀུན་ཏུ་བསྲུང་བར་ཡོངས་སུ་འཛིན་པའི་ངང་ཚུལ་ཅན། དམ་པའི་ཆོས་བསྲུང་བའི་ཁུར་ཁྱེར་བ་ཡོངས་སུ་འཛིན་པའི་ངང་ཚུལ་ཅན་ཤ་སྟག་སྟེ།
en: They all desired to explain the excellent Dharma. They conducted themselves by fully supporting all protectors of the excellent Dharma and fully bearing the burden of protecting the excellent Dharma.

source: ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Having arrived there, they all prostrated, touching their heads to his feet, and circumambulated the Bhagavān three times. With palms joined, they bowed toward the Bhagavān and sat down to one side.

source: ཡང་དེའི་ཚེ་གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་རྣམས་ཐོས་ཀྱི་བུ་ལ་སོགས་པ་གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ས་ཡ་ཕྲག་གསུམ་དང་དྲུག་འབུམ་ལ་འདི་ལྟ་སྟེ།
en: Also, at that time, there were three million six hundred thousand yakṣa kings, such as the yakṣa king Vaiśravaṇa and others.

source: གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་རྣམ་ཐོས་ཀྱི་བུ་ཞེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་མ་ལ་འབོད་ཅེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་མ་འཛིན་ཅེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་མ་ལ་དཔལ་དུ་འཛིན་པ་ཞེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ལག་སྒེག་ཅེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་འཇིགས་ཆེན་འཇིགས་བྱེད་ཅེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ཁྲོ་གཉེར་མིག་ཟུར་ཅན་ཞེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ས་སྒུལ་ཞེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ཉི་མ་རེངས་བྱེད་ཞེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ཤེས་ལྡན་ངང་ཚུལ་ཅན་ཞེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ནོར་བུ་བཟང་ཞེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་འོད་ཆགས་པད་མ་མཛོད་ཅེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ཤིང་རྟ་གཏོང་བའི་པད་མའི་སྙིང་པོ་དཔལ་ཞེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ཐབ་མོ་ལས་རྣམ་པར་རྒྱལ་བའི་གཡུལ་གྱི་དཔལ་ཞེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ལྔས་རྩེན་ཞེས་བྱ་བ་དང་། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ནོར་བུ་སྤྱོད་ཅེས་བྱ་བ་དང་།
en: These were the yakṣa king Vaiśravaṇa, the yakṣa king Crying Out, the yakṣa king Ungrasping, the yakṣa king Holder of Amazing Glory, the yakṣa king Charming Hands, the yakṣa king Great Fearsome Terrifier, the yakṣa king Inescapable Wrathful Brow, the yakṣa king Earth Quaker, the yakṣa king Sun Paralyzer, the yakṣa king Wise Conduct, the yakṣa king Fine Jewel, the yakṣa king Brilliant Lotus Storehouse, the yakṣa king Chariot-Driving Glorious Lotus Essence, the yakṣa king Glory of Completely Victorious Army, the yakṣa king Played by Five, and the yakṣa king Enjoying Jewels.

source: དེ་དག་ལ་སོགས་པ་གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་ས་ཡ་ཕྲག་གསུམ་དང་དྲུག་འབུམ་སྟེ། གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་རྗེས་སུ་སློབ་པར་འདོད་པ།
en: These yakṣa kings, numbering three million six hundred thousand, were all training according to the example of the bodhisattva conduct of the tathāgata Akṣobhya.

source: དམ་པའི་ཆོས་བསྲུང་བ་ཡོངས་སུ་འཛིན་པའི་ངང་ཚུལ་ཅན་ཤ་སྟག་སྟེ།
en: They all conducted themselves by fully supporting all protectors of the excellent Dharma.

source: ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས།
en: After noon they set forth from their respective abodes and went to where the Bhagavān was staying.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Having arrived there, they all prostrated, touching their heads to his feet, and circumambulated the Bhagavān three times. With palms joined, they bowed toward the Bhagavān and sat down to one side.

source: ཡང་དེའི་ཚེ་ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་ས་ཡ་ཕྲག་བཞི་དང་དགུ་འབུམ་ལ་འདི་ལྟ་སྟེ།
en: Also, at that time, there were four million nine hundred thousand garuḍa kings.
